#include"lcd.h"

/*******************************************************************************
* 函 数 名         :  Read_Busy
* 函数功能		     : 忙检测函数
* 输    入         : 无
* 输    出         : 无
* 说    名         : 应去掉led功能，判断bit7是0，允许执行；1禁止
*******************************************************************************/
void Read_Busy()          
{
    unsigned char sta;      //
    LCD1602_DB = 0xff;
    LCD1602_RS = 0;
    LCD1602_RW = 1;
    do
    {
        LCD1602_EN = 1;
        sta = LCD1602_DB;
        LCD1602_EN = 0;    //使能，用完就拉低，释放总线
    }while(sta & 0x80);
}
/*******************************************************************************
* 函 数 名         :   Lcd1602_Write_Cmd
* 函数功能		     :写命令
* 输    入         : 要写的命令
* 输    出         : 无
* 说    名         : LCD和LED不能同时用
*******************************************************************************/
void Lcd1602_Write_Cmd(unsigned char cmd)   
{
    Read_Busy();
    LCD1602_RS = 0;
    LCD1602_RW = 0;
    LCD1602_DB = cmd;
    LCD1602_EN = 1;
    LCD1602_EN = 0;    
}
/*******************************************************************************
* 函 数 名         :   Lcd1602_Write_Data
* 函数功能		     : 写数据
* 输    入         : 要写的数据
* 输    出         : 无
* 说    名         : LCD和LED不能同时用
*******************************************************************************/
void Lcd1602_Write_Data(unsigned char dat)   //写数据
{
      Read_Busy();
      LCD1602_RS = 1;
      LCD1602_RW = 0;
      LCD1602_DB = dat;
      LCD1602_EN = 1;
      LCD1602_EN = 0;
}
/*******************************************************************************
* 函 数 名         :   LcdSetCursor
* 函数功能		     : 坐标设置
* 输    入         : 坐标
* 输    出         : 无
* 说    名         : LCD和LED不能同时用
*******************************************************************************/
void LcdSetCursor(unsigned char x,unsigned char y) 
{
    unsigned char addr;
    if(y == 0)
        addr = 0x00 + x;
    else
        addr = 0x40 + x;
    
    Lcd1602_Write_Cmd(addr|0x80);
}
/*******************************************************************************
* 函 数 名         :   DisplayOneChar
* 函数功能		     : //按指定位置显示一个字符
* 输    入         : 坐标和数据
* 输    出         : 无
* 说    名         : LCD和LED不能同时用
*******************************************************************************/
void DisplayOneChar(unsigned char X, unsigned char Y, unsigned char DData)
{
	Y &= 0x1;
	X &= 0xF; //限制X不能大于15，Y不能大于1
	if (Y) X |= 0x40; //当要显示第二行时地址码+0x40;
	X |= 0x80; //算出指令码
	Lcd1602_Write_Cmd(X); //发命令字
	Lcd1602_Write_Data(DData); //发数据
}

/*******************************************************************************
* 函 数 名         :   turn_on_led
* 函数功能		     :   //显示字符串
* 输    入         : 坐标和字符串的首地址
* 输    出         : 无
* 说    名         : LCD和LED不能同时用
*******************************************************************************/
void LcdShowStr(unsigned char x,unsigned char y,unsigned char *str)     
{
    LcdSetCursor(x,y);      //当前字符的坐标
    while(*str != '\0')
    {
        Lcd1602_Write_Data(*str++);
    }
}
/*******************************************************************************
* 函 数 名         :   InitLcd1602
* 函数功能		     :1602初始化
* 输    入         : 无
* 输    出         : 无
* 说    名         : LCD和LED不能同时用
*******************************************************************************/
void InitLcd1602()              //1602初始化
{
    Lcd1602_Write_Cmd(0x38);    //打开，5*8,8位数据
    Lcd1602_Write_Cmd(0x0c);
    Lcd1602_Write_Cmd(0x06);
    Lcd1602_Write_Cmd(0x01);    //清屏   
}
